In [1]:
import pandas as pd

In [9]:
# ANS 1 => 

# 1. DataFrame() : used to create a new dataframe

data = [[3,4,5,6,7],[3,0,9,8,7],[4,3,5,6,7]]
df = pd.DataFrame(data)
df

   0  1  2  3  4
0  3  4  5  6  7
1  3  0  9  8  7
2  4  3  5  6  7

In [10]:
# 2. mean() : used to get mean all numeric values column

df.mean()

0    3.333333
1    2.333333
2    6.333333
3    6.666667
4    7.000000
dtype: float64

In [11]:
# 3. Series( ) create a pandas series

df = pd.Series([4,5,6,7,8,9])
type(df)

pandas.core.series.Series

In [12]:
# 4.sum() used to sum all numeric data columns

df.sum()

39

In [13]:
# 5. describe() returns the descriptive statistics about the data

df.describe()

count    6.000000
mean     6.500000
std      1.870829
min      4.000000
25%      5.250000
50%      6.500000
75%      7.750000
max      9.000000
dtype: float64

In [36]:
# ANS 2 =>

Data = [[3,5,1],[8,2,7],[6,9,4],[2,3,5],[9,1,2]]
df = pd.DataFrame(Data, columns = ['A','B','C'])
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [37]:
df.reindex([1,3])

   A  B  C
1  8  2  7
3  2  3  5

In [39]:
# ANS 3 =>

data={'Values':[10,20,30,40,50]}
df=pd.DataFrame(data)
df

   Values
0      10
1      20
2      30
3      40
4      50

In [41]:
def sumOfThree(df):
    three=df.iloc[:3]
    return three.sum()
sumOfThree(df)

Values    60
dtype: int64

In [43]:
# ANS 4 =>

data={'Text':['My','name','is','Yash','Sinha']}
df=pd.DataFrame(data)
df

    Text
0     My
1   name
2     is
3   Yash
4  Sinha

In [44]:
df['word_count']=df['Text'].str.len()
df

    Text  word_count
0     My           2
1   name           4
2     is           2
3   Yash           4
4  Sinha           5

In [48]:
# ANS 5 =>

# DataFrame.size it is return number_row*number_column

df = pd.DataFrame({'name':['ye','fee','gol','jho'],
                   'Age':[3,4,5,7]})
df.size

8

In [49]:
# DataFrame.shape it is return number_row,number_column

df = pd.DataFrame({'name':['ye','fee','gol','jho'],
                   'Age':[3,4,5,7]})
df.shape

(4, 2)

In [50]:
df

  name  Age
0   ye    3
1  fee    4
2  gol    5
3  jho    7

In [51]:
# ANS 6 =>

# pd.read_excel("excel_file_path")

In [52]:
# ANS 7 =>

df = pd.DataFrame({'Email':['yash.sinha@example.com','sarthak@gmail.com','shristy121@gmail.com']})
df

                    Email
0  yash.sinha@example.com
1       sarthak@gmail.com
2    shristy121@gmail.com

In [55]:
df[['username','company']] = df['Email'].str.split("@",expand=True,)
df.drop(df.columns[2], axis=1, inplace=True)
df

                    Email    username
0  yash.sinha@example.com  yash.sinha
1       sarthak@gmail.com     sarthak
2    shristy121@gmail.com  shristy121

In [56]:
# ANS 8 =>

Data = [[3,5,1],[8,2,7],[6,9,4],[2,3,5],[9,1,2]]
df = pd.DataFrame(Data, columns = ['A','B','C'])
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [60]:
df_sol=df[(df['A'] > 5) & (df['B'] < 10)]
df_sol

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [61]:
# ANS 9 =>

df = pd.DataFrame({'Values': [2,3,4,5,6,7,8]})
df

   Values
0       2
1       3
2       4
3       5
4       6
5       7
6       8

In [62]:
df.describe()

         Values
count  7.000000
mean   5.000000
std    2.160247
min    2.000000
25%    3.500000
50%    5.000000
75%    6.500000
max    8.000000

In [63]:
df.mean()

Values    5.0
dtype: float64

In [64]:
df.median()

Values    5.0
dtype: float64

In [65]:
df.std()

Values    2.160247
dtype: float64

In [66]:
# ANS 10 => 

import numpy as np

In [69]:
df = pd.DataFrame(pd.date_range(start='2023-02-10' , end = '2023-02-25'), columns = ['Date'])
df['Sales'] = np.random.randint(100,1000,size=(16))
df[['Sales','Date']]

    Sales       Date
0     778 2023-02-10
1     469 2023-02-11
2     979 2023-02-12
3     662 2023-02-13
4     279 2023-02-14
5     407 2023-02-15
6     260 2023-02-16
7     311 2023-02-17
8     447 2023-02-18
9     443 2023-02-19
10    712 2023-02-20
11    911 2023-02-21
12    503 2023-02-22
13    561 2023-02-23
14    831 2023-02-24
15    420 2023-02-25

In [70]:
df['MovingAverage']=df['Sales'].rolling(window=7).mean().round(2)
df

         Date  Sales  MovingAverage
0  2023-02-10    778            NaN
1  2023-02-11    469            NaN
2  2023-02-12    979            NaN
3  2023-02-13    662            NaN
4  2023-02-14    279            NaN
5  2023-02-15    407            NaN
6  2023-02-16    260         547.71
7  2023-02-17    311         481.00
8  2023-02-18    447         477.86
9  2023-02-19    443         401.29
10 2023-02-20    712         408.43
11 2023-02-21    911         498.71
12 2023-02-22    503         512.43
13 2023-02-23    561         555.43
14 2023-02-24    831         629.71
15 2023-02-25    420         625.86

In [71]:
# ANS 11 =>

date = pd.date_range(start='2023-01-01' , end = '2023-01-05')
df = pd.DataFrame({'Date':date})
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [72]:
df['Weekday'] = df['Date'].dt.day_name()
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [73]:
# ANS 12 =>

data = pd.date_range(start='2022-12-01', end='2023-02-28')
df_date = pd.DataFrame(data, columns=['Date'])
df_date

         Date
0  2022-12-01
1  2022-12-02
2  2022-12-03
3  2022-12-04
4  2022-12-05
..        ...
85 2023-02-24
86 2023-02-25
87 2023-02-26
88 2023-02-27
89 2023-02-28

[90 rows x 1 columns]

In [77]:
start = '2023-01-01'
end =  '2023-01-31'
mask = (df['Date'] > start) & (df['Date'] < end)
df.loc[mask]

        Date    Weekday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [ ]:
# ANS 13 =>

# To import the pandas library
import pandas as pd